{"modelTopology":{"class_name":"Model","config":{"name":"SimpleIntentClassifier","layers":[{"name":"SimpleIntentClassifier_InputLayer","class_name":"InputLayer","config":{"batch_input_shape":[null,12],"dtype":"float32","sparse":false,"name":"SimpleIntentClassifier_InputLayer"},"inbound_nodes":[]},{"name":"SimpleIntentClassifier_EmbeddingsLayer","class_name":"Embedding","config":{"input_dim":577,"output_dim":50,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":12,"name":"SimpleIntentClassifier_EmbeddingsLayer","trainable":true,"batch_input_shape":[null,12]},"inbound_nodes":[[["SimpleIntentClassifier_InputLayer",0,0,{}]]]},{"name":"SimpleIntentClassifier_LSTMLayer","class_name":"LSTM","config":{"name":"SimpleIntentClassifier_LSTMLayer","trainable":true,"units":128,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.6000000238418579,"recurrent_dropout":0.30000001192092896,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["SimpleIntentClassifier_EmbeddingsLayer",0,0,{}]]]},{"name":"SimpleIntentClassifier_DenseLayer","class_name":"Dense","config":{"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"SimpleIntentClassifier_DenseLayer","trainable":true},"inbound_nodes":[[["SimpleIntentClassifier_LSTMLayer",0,0,{}]]]}],"input_layers":[["SimpleIntentClassifier_InputLayer",0,0]],"output_layers":[["SimpleIntentClassifier_DenseLayer",0,0]]},"keras_version":"tfjs-layers 2.8.6","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"SimpleIntentClassifier_EmbeddingsLayer/embeddings","shape":[577,50],"dtype":"float32"},{"name":"SimpleIntentClassifier_LSTMLayer/kernel","shape":[50,512],"dtype":"float32"},{"name":"SimpleIntentClassifier_LSTMLayer/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"SimpleIntentClassifier_LSTMLayer/bias","shape":[512],"dtype":"float32"},{"name":"SimpleIntentClassifier_DenseLayer/kernel","shape":[128,3],"dtype":"float32"},{"name":"SimpleIntentClassifier_DenseLayer/bias","shape":[3],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.8.6","convertedBy":null}